# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO-TS-DRF: YOLO-TS with Dynamic Receptive Field Module
# DRF inserted after P2 and P3 C2f blocks for small-object enhancement

# Parameters
nc: 45  # number of classes
scales:
  # [depth, width, max_channels]
  l: [1, 1, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, C2f, [64, True]]       # 1
  - [-1, 1, Conv, [128, 3, 2]]     # 2-P2/4
  - [-1, 1, C2f, [128, True]]      # 3
  - [-1, 1, DRF, [128]]            # 4 - DRF after P2 C2f ★
  - [-1, 1, Conv, [256, 3, 2]]     # 5-P3/8
  - [-1, 1, C2f, [256, True]]      # 6
  - [-1, 1, DRF, [256]]            # 7 - DRF after P3 C2f ★
  - [-1, 1, Conv, [512, 3, 2]]     # 8-P4/16
  - [-1, 1, C2f, [512, True]]      # 9
  - [-1, 1, Conv, [1024, 3, 2]]    # 10-P5/32
  - [-1, 1, C2f, [1024, True]]     # 11
  - [-1, 1, SPPF, [1024]]          # 12

# Head
head:
  - [[7, 9, 12], 1, SimFusion_3in, []]   # 13 - fuse DRF-P3(7), P4(9), SPPF(12)
  - [-1, 1, dilation_block, [256]]        # 14

  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]  # 15
  - [[-1, 4], 1, Concat, [1]]            # 16 - cat with DRF-P2(4)
  - [-1, 1, Conv, [128, 1, 1]]           # 17
  - [-1, 1, Conv, [128, 3, 1]]           # 18

  - [[18], 1, Detect, [nc]]              # 19 - Detect(P2)
