# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 45  # number of classes
scales:
  # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1, 1, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 1, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 1, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 1, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024]] #10

# YOLOv8.0n head
head:
  - [[5, 7, 10], 1, SimFusion_3in, []]
  - [-1, 1, dilation_block, [256]]

  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P2
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, Conv, [128, 3, 1]]

  - [[16], 1, Detect, [nc]]  # Detect(P2)
